tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_flash.h
/** @defgroup FLASH_OB_USER_Type FLASH User Option Type
  * @{
  */
#define OB_USER_NRST_MODE       FLASH_OPTR_NRST_MODE 
#define OB_USER_IWDG_STOP       FLASH_OPTR_IWDG_STOP
#define OB_USER_IWDG_SW         FLASH_OPTR_IWDG_SW
#define OB_USER_WWDG_SW         FLASH_OPTR_WWDG_SW
#define OB_USER_NBOOT1          FLASH_OPTR_NBOOT1  
#define OB_USER_BOOT_LOCK       FLASH_OPTR_BOOT_LOCK
#define OB_USER_BOR_EN          FLASH_OPTR_BOR_EN
#define OB_USER_BOR_LEV         FLASH_OPTR_BOR_OPCR
#define OB_USER_SWD_MODE        FLASH_OPTR_SWD_MODE


#define OB_USER_OPTR_MSK        (OB_USER_NRST_MODE | OB_USER_IWDG_STOP | OB_USER_IWDG_SW | OB_USER_WWDG_SW \
                               | OB_USER_NBOOT1 | OB_USER_BOOT_LOCK | OB_USER_BOR_EN | OB_USER_BOR_LEV | OB_USER_SWD_MODE)


/**
  * @}
  */

/** @defgroup FLASH_Option_Bytes_Write_Protection FLASH Option Bytes Write Protection
  * @{
  */
#define FLASH_WRPR_WRP_0                0x00000001U  /* Write protection of  Sector0 */
#define FLASH_WRPR_WRP_1                0x00000002U  /* Write protection of  Sector1 */
#define FLASH_WRPR_WRP_2                0x00000004U  /* Write protection of  Sector2 */
#define FLASH_WRPR_WRP_3                0x00000008U  /* Write protection of  Sector3 */
#define FLASH_WRPR_WRP_4                0x00000010U  /* Write protection of  Sector4 */
#define FLASH_WRPR_WRP_5                0x00000020U  /* Write protection of  Sector5 */
#define FLASH_WRPR_WRP_6                0x00000040U  /* Write protection of  Sector6 */
#define FLASH_WRPR_WRP_7                0x00000080U  /* Write protection of  Sector7 */
#define FLASH_WRPR_WRP_8                0x00000100U  /* Write protection of  Sector8 */
#define FLASH_WRPR_WRP_9                0x00000200U  /* Write protection of  Sector9 */
#define FLASH_WRPR_WRP_10               0x00000400U  /* Write protection of  Sector10 */
#define FLASH_WRPR_WRP_11               0x00000800U  /* Write protection of  Sector11 */
#define FLASH_WRPR_WRP_12               0x00001000U  /* Write protection of  Sector12 */
#define FLASH_WRPR_WRP_13               0x00002000U  /* Write protection of  Sector13 */
#define FLASH_WRPR_WRP_14               0x00004000U  /* Write protection of  Sector14 */
#define FLASH_WRPR_WRP_15               0x00008000U  /* Write protection of  Sector15 */
#define FLASH_WRPR_WRP                  0xFFU        /* Write protection of ALL */

#define OB_WRP_SECTOR_0                  FLASH_WRPR_WRP_0   /* Write protection of  Sector0 */
#define OB_WRP_SECTOR_1                  FLASH_WRPR_WRP_1   /* Write protection of  Sector1 */
#define OB_WRP_SECTOR_2                  FLASH_WRPR_WRP_2   /* Write protection of  Sector2 */
#define OB_WRP_SECTOR_3                  FLASH_WRPR_WRP_3   /* Write protection of  Sector3 */
#define OB_WRP_SECTOR_4                  FLASH_WRPR_WRP_4   /* Write protection of  Sector4 */
#define OB_WRP_SECTOR_5                  FLASH_WRPR_WRP_5   /* Write protection of  Sector5 */
#define OB_WRP_SECTOR_6                  FLASH_WRPR_WRP_6   /* Write protection of  Sector6 */
#define OB_WRP_SECTOR_7                  FLASH_WRPR_WRP_7   /* Write protection of  Sector7 */
#define OB_WRP_SECTOR_8                  FLASH_WRPR_WRP_8   /* Write protection of  Sector8 */
#define OB_WRP_SECTOR_9                  FLASH_WRPR_WRP_9   /* Write protection of  Sector9 */
#define OB_WRP_SECTOR_10                 FLASH_WRPR_WRP_10  /* Write protection of  Sector10 */
#define OB_WRP_SECTOR_11                 FLASH_WRPR_WRP_11  /* Write protection of  Sector11 */
#define OB_WRP_SECTOR_12                 FLASH_WRPR_WRP_12  /* Write protection of  Sector12 */
#define OB_WRP_SECTOR_13                 FLASH_WRPR_WRP_13  /* Write protection of  Sector13 */
#define OB_WRP_SECTOR_14                 FLASH_WRPR_WRP_14  /* Write protection of  Sector14 */
#define OB_WRP_SECTOR_15                 FLASH_WRPR_WRP_15  /* Write protection of  Sector15 */

#define OB_WRP_Pages0to31               FLASH_WRPR_WRP_0    /* Write protection of  Sector0 */
#define OB_WRP_Pages32to63              FLASH_WRPR_WRP_1    /* Write protection of  Sector1 */
#define OB_WRP_Pages64to95              FLASH_WRPR_WRP_2    /* Write protection of  Sector2 */
#define OB_WRP_Pages96to127             FLASH_WRPR_WRP_3    /* Write protection of  Sector3 */
#define OB_WRP_Pages128to159            FLASH_WRPR_WRP_4    /* Write protection of  Sector4 */
#define OB_WRP_Pages160to191            FLASH_WRPR_WRP_5    /* Write protection of  Sector5 */
#define OB_WRP_Pages192to223            FLASH_WRPR_WRP_6    /* Write protection of  Sector6 */
#define OB_WRP_Pages224to255            FLASH_WRPR_WRP_7    /* Write protection of  Sector7 */
#define OB_WRP_Pages256to287            FLASH_WRPR_WRP_8    /* Write protection of  Sector8 */
#define OB_WRP_Pages288to319            FLASH_WRPR_WRP_9    /* Write protection of  Sector9 */
#define OB_WRP_Pages320to351            FLASH_WRPR_WRP_10   /* Write protection of  Sector10 */
#define OB_WRP_Pages352to383            FLASH_WRPR_WRP_11   /* Write protection of  Sector11 */
#define OB_WRP_Pages384to415            FLASH_WRPR_WRP_12   /* Write protection of  Sector12 */
#define OB_WRP_Pages416to447            FLASH_WRPR_WRP_13   /* Write protection of  Sector13 */
#define OB_WRP_Pages448to479            FLASH_WRPR_WRP_14   /* Write protection of  Sector14 */
#define OB_WRP_Pages480to511            FLASH_WRPR_WRP_15   /* Write protection of  Sector15 */

#define OB_WRP_AllPages                 FLASH_WRPR_WRP    /* Write protection of all Blocks */
/** 
  * @}
  */
  
/** @defgroup FLASH_Type_Program FLASH type program
  * @{
  */
#define FLASH_TYPEPROGRAM_PAGE             FLASH_CR_PG  /*!<Program 128bytes at a specified address.*/  
#define FLASH_TYPEPROGRAM_USERDATA         FLASH_CR_UPG /*!<Program 128bytes at userdata address.*/  
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_NRST_MODE FLASH Option Bytes User NRST mode bit
  * @{
  */
#define OB_NRST_MODE_RESET             0x00000000U            /*!< Reset pin is in Reset mode */
#define OB_NRST_MODE_GPIO              FLASH_OPTR_NRST_MODE   /*!< Reset pin is in GPIO mode */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_IWDG_STOP FLASH Option Bytes User IWDG Mode On Stop
  * @{
  */
#define OB_IWDG_STOP_FREEZE             0x00000000U              /*!< Independent watchdog counter is frozen in Stop mode */
#define OB_IWDG_STOP_RUN                FLASH_OPTR_IWDG_STOP     /*!< Independent watchdog counter is running in Stop mode */
/**
  * @}
  */

