tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_flash.h
/** @defgroup FLASH_OB_USER_IWDG_SW FLASH Option Bytes IWatchdog
  * @{
  */
#define OB_IWDG_HW                      0x00000000U          /*!< Hardware IWDG selected */
#define OB_IWDG_SW                      FLASH_OPTR_IWDG_SW   /*!< Software IWDG selected */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_WWDG_SW FLASH Option Bytes User WWDG Type
  * @{
  */
#define OB_WWDG_HW                      0x00000000U              /*!< Hardware window watchdog */
#define OB_WWDG_SW                      FLASH_OPTR_WWDG_SW       /*!< Software window watchdog */
/**
  * @}
  */
 
/** @defgroup FLASH_OB_USER_NBOOT1 FLASH Option Bytes User BOOT1 Type
  * @{
  */
#define OB_NBOOT1_SRAM                   0x00000000U          /*!< Embedded SRAM1 is selected as boot space (if BOOT0=1) */
#define OB_NBOOT1_SYSTEM                 (FLASH_OPTR_NBOOT1)  /*!< System memory is selected as boot space (if BOOT0=1) */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_BOOT_LOCK FLASH Option Bytes User Software BOOT0
  * @{
  */
#define OB_BOOT_FROM_OB                     0x00000000U             /*!< BOOT from IO or OB */
#define OB_BOOT_FROM_MAINFLASH              (FLASH_OPTR_BOOT_LOCK)  /*!< BOOT from MainFlash */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_BOR_EN FLASH Option Bytes BOR Enable
  * @{
  */
#define OB_BOR_DISABLE                  0x00000000U        /*!< BOR Reset set to default */
#define OB_BOR_ENABLE                   FLASH_OPTR_BOR_EN  /*!< Use option byte to define BOR thresholds */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_BOR_LEV FLASH Option Bytes BOR Level
  * @{
  */
#define OB_BOR_LEVEL_1p7_1p8    ((uint32_t)0x0000U)                                                                 /*!< BOR Reset threshold levels for 1.7V - 1.8V VDD power supply    */
#define OB_BOR_LEVEL_1p9_2p0    ((uint32_t)FLASH_OPTR_BOR_OPCR_0)                                                   /*!< BOR Reset threshold levels for 1.9V - 2.0V VDD power supply    */
#define OB_BOR_LEVEL_2p1_2p2    ((uint32_t)FLASH_OPTR_BOR_OPCR_1)                                                   /*!< BOR Reset threshold levels for 2.1V - 2.2V VDD power supply    */
#define OB_BOR_LEVEL_2p3_2p4    ((uint32_t)(FLASH_OPTR_BOR_OPCR_0 | FLASH_OPTR_BOR_OPCR_1))                         /*!< BOR Reset threshold levels for 2.3V - 2.4V VDD power supply    */
#define OB_BOR_LEVEL_2p7_2p8    ((uint32_t)FLASH_OPTR_BOR_OPCR_2)                                                   /*!< BOR Reset threshold levels for 2.7V - 2.8V VDD power supply    */
#define OB_BOR_LEVEL_3p0_3p1    ((uint32_t)(FLASH_OPTR_BOR_OPCR_0 | FLASH_OPTR_BOR_OPCR_2))                         /*!< BOR Reset threshold levels for 3.0V - 3.1V VDD power supply    */
#define OB_BOR_LEVEL_3p6_3p7    ((uint32_t)(FLASH_OPTR_BOR_OPCR_1 | FLASH_OPTR_BOR_OPCR_2))                         /*!< BOR Reset threshold levels for 3.6V - 3.7V VDD power supply    */
#define OB_BOR_LEVEL_4p1_4p2    ((uint32_t)(FLASH_OPTR_BOR_OPCR_0 | FLASH_OPTR_BOR_OPCR_1 | FLASH_OPTR_BOR_OPCR_2)) /*!< BOR Reset threshold levels for 4.1V - 4.2V VDD power supply    */
/**
  * @}
  */

/** @defgroup FLASH_OB_USER_SWD_MODE FLASH Option Bytes SWD MODE
  * @{
  */

#define OB_SWD_SWDIO_PA13_SWCLK_PA14            0x00000000U                                          /*!< PA13:SWDIO,PA14:SWCLK */
#define OB_SWD_SWDIO_PF1_SWCLK_PF0              FLASH_OPTR_SWD_MODE_0                                /*!< PF1:SWDIO,PF0:SWCLK */
#define OB_SWD_SWDIO_PF1_SWCLK_PA14             FLASH_OPTR_SWD_MODE_1                                /*!< PF1:SWDIO,PA14:SWCLK */
#define OB_SWD_SWDIO_PA13_SWCLK_PF0             (FLASH_OPTR_SWD_MODE_1 | FLASH_OPTR_SWD_MODE_0)      /*!< PA13:SWDIO,PF0:SWCLK */
/**
  * @}
  */


/** @defgroup FLASH_Latency FLASH Latency
  * @{
  */
#define FLASH_LATENCY_0                 (0x00000000UL)         /*!< FLASH 0 wait state */
#define FLASH_LATENCY_1                 (FLASH_ACR_LATENCY_0)  /*!< FLASH 1 wait state */
#define FLASH_LATENCY_2                 (FLASH_ACR_LATENCY_1)  /*!< FLASH 2 wait state */
#define FLASH_LATENCY_3                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_1)  /*!< FLASH 3 wait state */
/**
  * @}
  */

/** @defgroup FLASH_Flags FLASH Flags Definition
  * @{
  */
#define FLASH_FLAG_EOP                  FLASH_SR_EOP       /*!< FLASH End of operation flag */
#define FLASH_FLAG_WRPERR               FLASH_SR_WRPERR    /*!< FLASH Write protection error flag */
#define FLASH_FLAG_RDERR                FLASH_SR_RDERR     /*!< FLASH PCROP error flag */
#define FLASH_FLAG_OPTVERR              FLASH_SR_OPTVERR   /*!< FLASH Option validity error flag */
#define FLASH_FLAG_BSY                  FLASH_SR_BSY       /*!< FLASH Operation Busy flag */
#define FLASH_FLAG_USRLOCK              FLASH_SR_USERLOCK  /*!< FLASH User Lock flag */

#define FLASH_FLAG_SR_ERRORS            (FLASH_FLAG_WRPERR | FLASH_FLAG_RDERR | FLASH_FLAG_OPTVERR)

#define FLASH_FLAG_ALL_ERRORS           (FLASH_FLAG_SR_ERRORS)
/**
  * @}
  */

/** @defgroup FLASH_Interrupt_definition FLASH Interrupts Definition
  * @brief FLASH Interrupt definition
  * @{
  */
#define FLASH_IT_EOP                    FLASH_CR_EOPIE                                       /*!< End of FLASH Operation Interrupt source */
#define FLASH_IT_OPERR                  FLASH_CR_ERRIE                                       /*!< Error Interrupt source */
#define FLASH_IT_RDERR                  FLASH_CR_RDERRIE                                     /*!< PCROP0 Read Error Interrupt source*/
#define FLASH_IT_ALL                    (FLASH_CR_EOPIE | FLASH_CR_ERRIE | FLASH_CR_RDERRIE)
/**
  * @}
  */

/** @defgroup FLASH_EnterLpmode_Delay FLASH Enter LpMode Delay Time 
  * @{
  */
#define Flash_EnterLpmodeDelay_1HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_0)
#define Flash_EnterLpmodeDelay_2HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_1)
#define Flash_EnterLpmodeDelay_3HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_1 | FLASH_LPCR_LPRUN_ENTERT_0)
#define Flash_EnterLpmodeDelay_4HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_2)
#define Flash_EnterLpmodeDelay_5HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_2 | FLASH_LPCR_LPRUN_ENTERT_0)
#define Flash_EnterLpmodeDelay_6HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_2 | FLASH_LPCR_LPRUN_ENTERT_1)
#define Flash_EnterLpmodeDelay_7HSIDIVCLOCK         (FLASH_LPCR_LPRUN_ENTERT_2 | FLASH_LPCR_LPRUN_ENTERT_1 | FLASH_LPCR_LPRUN_ENTERT_0) 
/**
  * @}
  */

/** @defgroup FLASH_ExitLpmode_Delay FLASH Exit LpMode Delay Time 
  * @{
  */
#define Flash_ExitLpmodeDelay_1HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_0)
#define Flash_ExitLpmodeDelay_2HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_1)
#define Flash_ExitLpmodeDelay_3HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_1 | FLASH_LPCR_LPRUN_EXITT_0)
#define Flash_ExitLpmodeDelay_4HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_2)
#define Flash_ExitLpmodeDelay_5HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_2 | FLASH_LPCR_LPRUN_EXITT_0)
#define Flash_ExitLpmodeDelay_6HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_2 | FLASH_LPCR_LPRUN_EXITT_1)
#define Flash_ExitLpmodeDelay_7HSIDIVCLOCK         (FLASH_LPCR_LPRUN_EXITT_2 | FLASH_LPCR_LPRUN_EXITT_1 | FLASH_LPCR_LPRUN_EXITT_0) 
/**
  * @}
  */


/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup FLASH_Exported_Macros FLASH Exported Macros
  *  @brief macros to control FLASH features
  *  @{
  */

/**
  * @brief  Set the FLASH Latency.
  * @param  __LATENCY__ FLASH Latency
  *         This parameter can be one of the following values :
  *     @arg @ref FLASH_LATENCY_0 FLASH Zero wait state
  *     @arg @ref FLASH_LATENCY_1 FLASH One wait state
  *     @arg @ref FLASH_LATENCY_2 FLASH Two wait states
  *     @arg @ref FLASH_LATENCY_3 FLASH Four wait states
  * @retval None
  */
#define __HAL_FLASH_SET_LATENCY(__LATENCY__)    MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, (__LATENCY__))

/**
  * @brief  Get the FLASH Latency.
  * @retval FLASH Latency
  *         Returned value can be one of the following values :
  *     @arg @ref FLASH_LATENCY_0 FLASH Zero wait state
  *     @arg @ref FLASH_LATENCY_1 FLASH One wait state
  *     @arg @ref FLASH_LATENCY_2 FLASH Two wait states
  *     @arg @ref FLASH_LATENCY_3 FLASH Four wait states
  */
#define __HAL_FLASH_GET_LATENCY()               READ_BIT(FLASH->ACR, FLASH_ACR_LATENCY)

