tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Inc/py32f032_hal_flash.h
#define IS_FLASH_MAIN_MEM_ADDRESS(__ADDRESS__)        (((__ADDRESS__) >= (FLASH_BASE)) && ((__ADDRESS__) <= (FLASH_BASE + FLASH_SIZE - 1UL)))

#define IS_FLASH_PROGRAM_MAIN_MEM_ADDRESS(__ADDRESS__) (((__ADDRESS__) >= (FLASH_BASE)) && ((__ADDRESS__) <= (FLASH_BASE + FLASH_SIZE - 256UL)))

#define IS_FLASH_PROGRAM_ADDRESS(__ADDRESS__)         (IS_FLASH_PROGRAM_MAIN_MEM_ADDRESS(__ADDRESS__))

#define  IS_FLASH_PROGRAM_USERDATA_ADDRESS(__ADDRESS__)  (((__ADDRESS__) >= (0x1fff0e00)) && ((__ADDRESS__) <= 0x1fff0e7c))


#define IS_FLASH_NB_PAGES(__ADDRESS__, __VALUE__)     (((__ADDRESS__) >= (FLASH_BASE)) && ((__ADDRESS__ + ((__VALUE__*FLASH_PAGE_SIZE)) - 1) <= (FLASH_BASE + FLASH_SIZE - 1UL))&&(__VALUE__ >0 ))

#define IS_FLASH_NB_SECTORS(__ADDRESS__, __VALUE__)   (((__ADDRESS__) >= (FLASH_BASE)) && ((__ADDRESS__ + ((__VALUE__*FLASH_SECTOR_SIZE)) - 1) <= (FLASH_BASE + FLASH_SIZE - 1UL))&&(__VALUE__>0 ))

#define IS_FLASH_NB_BLOCKS(__ADDRESS__, __VALUE__)    (((__ADDRESS__) >= (FLASH_BASE)) && ((__ADDRESS__ + ((__VALUE__*FLASH_BLOCK_SIZE)) - 1) <= (FLASH_BASE + FLASH_SIZE - 1UL)) &&(__VALUE__ >0 ))

#define IS_FLASH_PAGE(__PAGE__)                       ((__PAGE__) < FLASH_PAGE_NB)

#define IS_OPTIONBYTE(__VALUE__)                      (((__VALUE__) <= (OPTIONBYTE_WRP | OPTIONBYTE_RDP | OPTIONBYTE_USER | OPTIONBYTE_PCROP | OPTIONBYTE_SEC)))

#define IS_FLASH_TYPEPROGRAM(__VALUE__)               ((__VALUE__) == FLASH_TYPEPROGRAM_PAGE)

#define IS_OB_WRPAREA(__VALUE__)                      (((__VALUE__) == OB_WRP_SECTOR_0) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_1) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_2) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_3) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_4) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_5) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_6) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_7) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_8) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_9) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_10) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_11) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_12) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_13) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_14) || \
                                                       ((__VALUE__) == OB_WRP_SECTOR_15))

#define IS_OB_RDP_LEVEL(LEVEL)                         (((LEVEL) == OB_RDP_LEVEL_0) ||\
                                                        ((LEVEL) == OB_RDP_LEVEL_1) ||\
                                                        ((LEVEL) == OB_RDP_LEVEL_2))

#define IS_OB_USER_TYPE(__TYPE__)                     ((((__TYPE__) & OB_USER_OPTR_MSK) != 0x00U) && \
                                                       (((__TYPE__) & ~OB_USER_OPTR_MSK) == 0x00U))

#define IS_OB_USER_CONFIG(__TYPE__,__CONFIG__)         ((~(__TYPE__) & (__CONFIG__)) == 0x00U)

#define IS_OB_USER_STOP(__VALUE__)                    (((__VALUE__) == OB_STOP_RST) || \
                                                       ((__VALUE__) == OB_STOP_NORST))

#define IS_OB_USER_IWDG(__VALUE__)                    (((__VALUE__) == OB_IWDG_HW) || \
                                                       ((__VALUE__) == OB_IWDG_SW))

#define IS_OB_USER_IWDG_STOP(__VALUE__)               (((__VALUE__) == OB_IWDG_STOP_FREEZE) || \
                                                       ((__VALUE__) == OB_IWDG_STOP_RUN))

#define IS_OB_USER_WWDG(__VALUE__)                    (((__VALUE__) == OB_WWDG_HW) || \
                                                       ((__VALUE__) == OB_WWDG_SW))
                                                       
#define IS_OB_USER_BOOT1(__VALUE__)                   (((__VALUE__) == OB_BOOT1_SRAM) || \
                                                       ((__VALUE__) == OB_BOOT1_SYSTEM))

#define IS_OB_USER_BOOT0(__VALUE__)                   (((__VALUE__) == OB_NBOOT0_RESET) || \
                                                       ((__VALUE__) == OB_NBOOT0_SET))

#define IS_OB_USER_NRST_MODE(__VALUE__)               (((__VALUE__) == OB_NRST_MODE_RESET) || \
                                                       ((__VALUE__) == OB_NRST_MODE_GPIO))

#define IS_OB_USER_BOR(__VALUE__)                     (((__VALUE__) == OB_BOR_DISABLE) || \
                                                       ((__VALUE__) == OB_BOR_ENABLE))

#define IS_OB_USER_BOR_LEVEL(__LEVEL__)               (((__LEVEL__) == OB_BOR_LEVEL_1p7_1p8) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_1p9_2p0) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_2p1_2p2) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_2p3_2p4) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_2p7_2p8) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_3p0_3p1) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_3p6_3p7) || \
                                                       ((__LEVEL__) == OB_BOR_LEVEL_4p1_4p2))


#define IS_OB_USER_SWD_MODE(__MODE__)                 (((__MODE__) == OB_SWD_SWDIO_PA13_SWCLK_PA14) || \
                                                       ((__MODE__) == OB_SWD_SWDIO_PF1_SWCLK_PF0) || \
                                                       ((__MODE__) == OB_SWD_SWDIO_PF1_SWCLK_PA14) || \
                                                       ((__MODE__) == OB_SWD_SWDIO_PA13_SWCLK_PF0))

#define IS_OB_USER_BOOT(__BOOT__)                     (((__BOOT__) == OB_BOOT_FROM_OB) || \
                                                       ((__BOOT__) == OB_BOOT_FROM_MAINFLASH))

#define IS_OB_SECMEM_SIZE(VALUE)                      ((VALUE) <= FLASH_PAGE_NB)

#define IS_FLASH_LATENCY(__LATENCY__)                  (((__LATENCY__) == FLASH_LATENCY_0)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_1)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_2)  || \
                                                        ((__LATENCY__) == FLASH_LATENCY_3))

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32F032_HAL_FLASH_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
